# Pandas 数据处理

参考书: [Python Data Science Handbook](https://github.com/jakevdp/PythonDataScienceHandbook)

![image.png](attachment:image.png)

In [5]:
import pandas as pd
pd.__version__

'0.25.0'

In [6]:
pd.__file__

'D:\\xuhui\\program64\\Anaconda\\envs\\pytorch\\lib\\site-packages\\pandas\\__init__.py'

In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

## pandas 对象简介
+ Series对象
+ DataFrame对象

### Series对象

In [8]:
p0 = pd.Series([1,2,3])
p0

0    1
1    2
2    3
dtype: int64

In [9]:
p0.values

array([1, 2, 3], dtype=int64)

In [10]:
p0.index

RangeIndex(start=0, stop=3, step=1)

In [11]:
n0 = p0.to_numpy()
n0

array([1, 2, 3], dtype=int64)

In [12]:
n0[:] = -1
p0

0   -1
1   -1
2   -1
dtype: int64

### Series 是特殊的`Numpy`数组

`Numpy`的数组隐含是整数索引, 而`Series`的索引不仅可以是整数, 还可以任何hash-type的类型.

In [13]:
data = pd.Series([0.1, 0.2, 0.3, 0.4], index=['a', 'b', 'c', 'd'])
data

a    0.1
b    0.2
c    0.3
d    0.4
dtype: float64

In [14]:
data['c']

0.3

In [15]:
data['a':'c']

a    0.1
b    0.2
c    0.3
dtype: float64

In [16]:
data = pd.Series([0.2, 0.3, 0.7, 0.9], index=[2,9,10,8])

In [17]:
data

2     0.2
9     0.3
10    0.7
8     0.9
dtype: float64

In [18]:
data[2] # 优先显示索引

0.2

### `Series`也可以看成特殊的字典

In [20]:
p_dict = {'数学':88, '物理':99, '英语':123, '历史':83}
p = pd.Series(p_dict)
p

数学     88
物理     99
英语    123
历史     83
dtype: int64

In [21]:
p['数学':'英语']

数学     88
物理     99
英语    123
dtype: int64

### 新建`Series`对象

新建`Series`对象的一般方法为:

```python
pd.Series(data, index=index)
```

`index`, 是可选的, 默认是整数.

In [22]:
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [23]:
pd.Series(5, index=[1,2,3])

1    5
2    5
3    5
dtype: int64

In [25]:
pd.Series({2:'b', 3:'c', 5:'e'})

2    b
3    c
5    e
dtype: object

## `DataFrame`对象
### `DataFrame` 可以看成特殊的二维`Numpy array`

In [26]:
score_dict = {"数学": 88, "物理": 99, 
          "英语": 123, "历史": 83}
score = pd.Series(score_dict)

In [29]:
numbs_dict = {"数学": 100, "物理": 99, 
          "英语": 200, "历史": 300}
nums = pd.Series(numbs_dict)

In [30]:
data = pd.DataFrame({'score':score, 'nums':nums})
data

    score  nums
数学     88   100
物理     99    99
英语    123   200
历史     83   300

In [31]:
data.index

Index(['数学', '物理', '英语', '历史'], dtype='object')

In [32]:
data.columns

Index(['score', 'nums'], dtype='object')

`DataFrame`作为特殊的二维数组, 但是行和列都有特殊的`index`.
### `DataFrame` 也可以看成特殊的字典

In [35]:
data['score']

数学     88
物理     99
英语    123
历史     83
Name: score, dtype: int64

### 新建`DataFrame`

In [36]:
score

数学     88
物理     99
英语    123
历史     83
dtype: int64

In [41]:
p0 = pd.DataFrame(score, columns=['score'])
p0

    score
数学     88
物理     99
英语    123
历史     83

注意只有一列的`DataFrame`跟`Series`不同.

In [39]:
p0.iloc[:,0]

数学     88
物理     99
英语    123
历史     83
Name: score, dtype: int64

In [43]:
pos_pd = pd.DataFrame(np.random.rand(1000,3),columns=['x', 'y', 'z'])

In [45]:
pd.options.display.max_rows = 10
pos_pd

            x         y         z
0    0.466698  0.872437  0.887795
1    0.823611  0.484621  0.413016
2    0.062969  0.383345  0.282776
3    0.701678  0.950825  0.218677
4    0.205440  0.889796  0.663177
..        ...       ...       ...
995  0.776809  0.387370  0.998074
996  0.686208  0.936417  0.138721
997  0.952764  0.427076  0.606595
998  0.434974  0.584063  0.979554
999  0.602245  0.025858  0.115746

[1000 rows x 3 columns]

In [46]:
p0 = pd.DataFrame({'x':np.random.randn(10), 'y':np.random.randn(10)})
p0

          x         y
0  1.277032  1.534701
1 -1.208313 -0.870192
2  1.075304  0.221895
3 -0.736108 -1.738758
4  0.725650 -0.247577
5 -0.884478  0.074391
6  2.364718  0.903789
7  0.941370  1.171183
8  0.183619 -0.263984
9 -0.370762 -1.155484

## `Index`对象
Index 可以看成不可变的数组

In [47]:
ind = pd.Index([1,3,5])
ind

Int64Index([1, 3, 5], dtype='int64')

In [48]:
ind[1]

3

In [49]:
ind.shape, ind.size, ind.ndim, ind.dtype

((3,), 3, 1, dtype('int64'))

# 数据索引与选择
## `Series` 数据选择方法

In [50]:
data = pd.Series([0.25, 0.5, 0.75, 1.0, 2.0],
                 index=['a', 'b', 'c', 'd', "d"])
data

a    0.25
b    0.50
c    0.75
d    1.00
d    2.00
dtype: float64

看成字典

In [52]:
data['b'], 'a' in data

(0.5, True)

In [53]:
data.index

Index(['a', 'b', 'c', 'd', 'd'], dtype='object')

In [54]:
for i,j in data.items():
    print(i,j)

a 0.25
b 0.5
c 0.75
d 1.0
d 2.0

看成一维数组

In [55]:
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [56]:
data[(data>0.1)&(data<0.8)]

a    0.25
b    0.50
c    0.75
dtype: float64

Indexers: loc, iloc

如果`Series`是不连续整数的话, 索引操作`data[1]`会使用显示索引, 切片操作会使用隐含索引.

In [73]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [74]:
# explicit index when indexing
data[1]

'a'

In [75]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

* `loc`函数可以用来显示索引(explicit index)
* `iloc`函数用来隐式索引(implicit index)

In [76]:
data.loc[1], data[1]

('a', 'a')

In [82]:
data.loc[1:3]

1    a
3    b
dtype: object

In [78]:
data.iloc[1]

'b'

In [83]:
data.iloc[1:3]

3    b
5    c
dtype: object

## `DataFrame`数据选择方法

将`DataFrame`看成字典

In [84]:
p0 = pd.DataFrame({"x": np.random.randn(3), 
                  "y":np.random.randn(3)})
p0

          x         y
0  0.124742  1.002803
1 -1.934510 -1.482241
2 -0.519592 -0.324088

In [85]:
p0['x']

0    0.124742
1   -1.934510
2   -0.519592
Name: x, dtype: float64

In [87]:
p0.x

0    0.124742
1   -1.934510
2   -0.519592
Name: x, dtype: float64

In [89]:
p0['z'] = p0['x'] + p0['y']
p0

          x         y         z
0  0.124742  1.002803  1.127545
1 -1.934510 -1.482241 -3.416751
2 -0.519592 -0.324088 -0.843680

将`DataFrame`看成二维数组

In [90]:
p0.values

array([[ 0.12474182,  1.00280286,  1.12754469],
       [-1.93450997, -1.48224086, -3.41675083],
       [-0.51959184, -0.32408781, -0.84367966]])

In [91]:
p0.keys

<bound method NDFrame.keys of           x         y         z
0  0.124742  1.002803  1.127545
1 -1.934510 -1.482241 -3.416751
2 -0.519592 -0.324088 -0.843680>

In [92]:
p0.T

          0         1         2
x  0.124742 -1.934510 -0.519592
y  1.002803 -1.482241 -0.324088
z  1.127545 -3.416751 -0.843680

In [93]:
p0.values[0]

array([0.12474182, 1.00280286, 1.12754469])

In [94]:
p0['x']

0    0.124742
1   -1.934510
2   -0.519592
Name: x, dtype: float64

In [95]:
p0.loc[:1,['x','z']]

          x         z
0  0.124742  1.127545
1 -1.934510 -3.416751

In [97]:
p0.loc[p0.x>0.0, ['x','y']]

          x         y
0  0.124742  1.002803

其他的约定, 索引对应列, 切片对应行.

In [98]:
p0['x']

0    0.124742
1   -1.934510
2   -0.519592
Name: x, dtype: float64

In [99]:
p0[0:3]

          x         y         z
0  0.124742  1.002803  1.127545
1 -1.934510 -1.482241 -3.416751
2 -0.519592 -0.324088 -0.843680

In [101]:
p0[p0.x>0.0] #条件索引

          x         y         z
0  0.124742  1.002803  1.127545

# 操作Pandas的数据
## 索引保留

In [102]:
ser = pd.Series(np.random.rand(5))
df = pd.DataFrame(np.random.rand(5,3), columns=['A','B','C'])

In [103]:
ser

0    0.320876
1    0.275388
2    0.964046
3    0.137933
4    0.150402
dtype: float64

In [104]:
np.exp(ser)

0    1.378335
1    1.317042
2    2.622286
3    1.147898
4    1.162301
dtype: float64

In [105]:
np.sin(df*np.pi/10)

          A         B         C
0  0.148987  0.199759  0.056956
1  0.113576  0.040758  0.195374
2  0.283267  0.020397  0.192723
3  0.198118  0.126651  0.057758
4  0.213669  0.292455  0.093443

## 索引对齐

In [107]:
s0 = pd.Series({"x": 3, "y": 2.3, "z":2.1})
s1 = pd.Series({"x": 3, "y": 2.3, "m":2.1, "n":2.22})
s0

x    3.0
y    2.3
z    2.1
dtype: float64

In [108]:
s0/s1

m    NaN
n    NaN
x    1.0
y    1.0
z    NaN
dtype: float64

In [110]:
s0.divide(s1, fill_value=0.0)

m    0.0
n    0.0
x    1.0
y    1.0
z    inf
dtype: float64

In [111]:
s0.index | s1.index

Index(['m', 'n', 'x', 'y', 'z'], dtype='object')

In [112]:
A = pd.DataFrame(np.random.randint(0,20,(2,2)), columns=list('AB'))
B = pd.DataFrame(np.random.randint(0,10,(3,3)), columns=list('ABC'))

In [113]:
A

    A   B
0  15  12
1   0  19

In [114]:
B

   A  B  C
0  9  9  7
1  1  0  5
2  5  7  7

In [115]:
A+B

      A     B   C
0  24.0  21.0 NaN
1   1.0  19.0 NaN
2   NaN   NaN NaN

python 运算符号对应的pandas函数
+ +:add()
+ -:sub(), subtract()
+ *:mul(), multiply()
+ /:div(), divide()
+ //:floordiv()
+ %:mod()
+ **:pow()

## `DataFrame`与`Series`之间的操作

In [120]:
A = np.random.randn(4, 3)
df = pd.DataFrame(A, columns=list("ABC"))
df

          A         B         C
0 -1.526816  0.009474  1.516946
1  0.246007 -0.555057  1.669989
2  0.279563 -1.501776  0.576333
3  0.457643 -0.101939  0.531684

In [121]:
df - df.iloc[0]

          A         B         C
0  0.000000  0.000000  0.000000
1  1.772823 -0.564531  0.153044
2  1.806380 -1.511250 -0.940612
3  1.984459 -0.111412 -0.985262

In [122]:
df.sub(df['B'], axis=0)

          A    B         C
0 -1.536290  0.0  1.507472
1  0.801064  0.0  2.225046
2  1.781339  0.0  2.078109
3  0.559582  0.0  0.633623

In [124]:
s3 = df.iloc[0, ::2]
s3

A   -1.526816
C    1.516946
Name: 0, dtype: float64

In [126]:
df.sub(s3)

          A   B         C
0  0.000000 NaN  0.000000
1  1.772823 NaN  0.153044
2  1.806380 NaN -0.940612
3  1.984459 NaN -0.985262

# 处理缺失值
`Pandas`中用`NaN(not a number)`表示缺省值.

In [127]:
p1 = pd.Series(['a', None, 'c'])
p1

0       a
1    None
2       c
dtype: object

In [128]:
p1[0] = np.nan
p1

0     NaN
1    None
2       c
dtype: object

## 处理缺失值的函数
* isnull
* notnull
* dropna
* fillna
* drop_duplicates

In [135]:
p1 = pd.Series([1,2,2,None])
p1

0    1.0
1    2.0
2    2.0
3    NaN
dtype: float64

In [136]:
p1.drop_duplicates()

0    1.0
1    2.0
3    NaN
dtype: float64

In [137]:
p1.fillna(3)

0    1.0
1    2.0
2    2.0
3    3.0
dtype: float64

# 层级索引
层级索引的目的是用`Series`和`DataFrame`表示高维数据, 首先看一下如何手动用`Series`表示二维数据.

In [138]:
index = [('California',2000), ('California',2010), ('New York',2000),
        ('New York',2010), ('Texas',2000), ('Texas',2010)]
populations = [33871648, 37253956,
                18976457, 19378102,
                20851820, 25145561]
pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [141]:
pop[[i for i in pop.index if i[1]==2010]]

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [142]:
index1 = pd.MultiIndex.from_tuples(index)
index1

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [145]:
pop1 = pop.reindex(index1)
pop1

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [146]:
pop1[:,2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [147]:
pop_df = pop1.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [148]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

将具有`MultiIndex`的`Series`增加一列, 解释具有`MultiIndex`的`DataFrame`.

In [149]:
pop_df1 = pd.DataFrame({'total':pop1, 'under18':[9267089, 9284094,
                        4687374, 4318033,
                        5906301, 6879014]})
pop_df1

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [150]:
f_u18 = pop_df1['under18'] / pop_df1['total']
f_u18

California  2000    0.273594
            2010    0.249211
New York    2000    0.247010
            2010    0.222831
Texas       2000    0.283251
            2010    0.273568
dtype: float64

In [152]:
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

## 创建`MultiIndex`的方法

In [153]:
df = pd.DataFrame(np.random.rand(4,2),
                 index=[['a','a','b','b'],[1,2,1,2]],
                 columns=['data1','data2'])
df

        data1     data2
a 1  0.559977  0.370255
  2  0.987302  0.877482
b 1  0.306009  0.327809
  2  0.580005  0.148335

In [154]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [156]:
pd.MultiIndex.from_arrays([['a','a','b','b'],[1,2,1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [157]:
list(zip(['a','a','b','b'],[1,2,1,2]))

[('a', 1), ('a', 2), ('b', 1), ('b', 2)]

In [158]:
pd.MultiIndex.from_tuples([('a', 1), ('a', 2), ('b', 1), ('b', 2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [159]:
pd.MultiIndex.from_product([['a','b'],[1,2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [160]:
pd.MultiIndex(levels=[['a','b'],[1,2]],
             codes=[[0,0,1,1],[0,1,0,1]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [161]:
pop1

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [162]:
pop1.index.names = ['🗺','年']
pop1

🗺           年
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [165]:
# hierarchical indices and columns.
index = pd.MultiIndex.from_product([[2013,2014],[1,2]],names=['year','visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'],['HR', 'Temp']],
                                     names=['person','type'])

# mock some data.
data = np.round(np.random.randn(4,6),1) # 四舍五入,保留一位小数点
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

person       Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      47.0  36.6  42.0  37.0  31.0  37.7
     2      31.0  36.1  32.0  36.6  31.0  36.2
2014 1      48.0  39.1  45.0  37.0  41.0  36.9
     2      20.0  36.1  28.0  38.3  28.0  36.9

In [163]:
np.round?

In [166]:
health_data['Bob']

type          HR  Temp
year visit
2013 1      47.0  36.6
     2      31.0  36.1
2014 1      48.0  39.1
     2      20.0  36.1

## 多级索引的取值与切片

In [167]:
pop1

🗺           年
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [168]:
pop1['California', 2000]

33871648

In [170]:
pop1['California']

年
2000    33871648
2010    37253956
dtype: int64

In [171]:
pop1[pop1 > 22000000]

🗺           年
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [172]:
health_data

person       Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      47.0  36.6  42.0  37.0  31.0  37.7
     2      31.0  36.1  32.0  36.6  31.0  36.2
2014 1      48.0  39.1  45.0  37.0  41.0  36.9
     2      20.0  36.1  28.0  38.3  28.0  36.9

In [176]:
health_data[('Guido', 'HR')]

year  visit
2013  1        42.0
      2        32.0
2014  1        45.0
      2        28.0
Name: (Guido, HR), dtype: float64

In [174]:
health_data.loc[:, ('Bob','HR')]

year  visit
2013  1        47.0
      2        31.0
2014  1        48.0
      2        20.0
Name: (Bob, HR), dtype: float64

In [179]:
idx = pd.IndexSlice
health_data.loc[idx[:,1],idx[:,'HR']]

person       Bob Guido   Sue
type          HR    HR    HR
year visit
2013 1      47.0  42.0  31.0
2014 1      48.0  45.0  41.0

In [180]:
pop1

🗺           年
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [181]:
pop_flat = pop1.reset_index(name='population') # 将seriesreset为DataFrame
pop_flat

            🗺     年  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [182]:
type(pop1), type(pop_flat)

(pandas.core.series.Series, pandas.core.frame.DataFrame)

In [185]:
pop_flat.set_index(['🗺','年']) # 将DataFrame的列设置为index

                 population
🗺          年
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

## 多级索引统计方法

In [186]:
health_data

person       Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      47.0  36.6  42.0  37.0  31.0  37.7
     2      31.0  36.1  32.0  36.6  31.0  36.2
2014 1      48.0  39.1  45.0  37.0  41.0  36.9
     2      20.0  36.1  28.0  38.3  28.0  36.9

In [187]:
data_mean = health_data.mean(level='visit')
data_mean

person   Bob        Guido          Sue
type      HR   Temp    HR   Temp    HR   Temp
visit
1       47.5  37.85  43.5  37.00  36.0  37.30
2       25.5  36.10  30.0  37.45  29.5  36.55

In [188]:
data_mean.mean(level='type',axis=1)

type          HR       Temp
visit
1      42.333333  37.383333
2      28.333333  36.700000

# 合并数据集: join and merge
## 一对一连接

In [190]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                        'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
'hire_date': [2004, 2008, 2012, 2014]})

In [192]:
df1

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

In [193]:
df2

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [194]:
df3 = pd.merge(df1,df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

## 多对一连接

In [195]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                               'supervisor': ['Carly', 'Guido', 'Steve']})

In [196]:
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [197]:
pd.merge(df3, df4)

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

## 多对多连接

In [198]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting',
                                         'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux',
                                      'spreadsheets', 'organization']})

In [199]:
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [200]:
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

# 累计与分组

In [203]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [204]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

## 简单累计功能

In [205]:
ser = pd.Series(np.random.random(5))
ser

0    0.484065
1    0.085085
2    0.213212
3    0.821103
4    0.016819
dtype: float64

In [206]:
ser.sum(), ser.mean()

(1.6202839132755438, 0.32405678265510873)

In [207]:
df = pd.DataFrame({"X": np.random.randn(5),
                 "Y": np.random.randn(5)})
df

          X         Y
0  1.214094  0.281574
1  0.134815  2.053327
2 -0.503687 -1.215445
3  0.330026 -0.184427
4 -0.634511 -2.290720

In [208]:
df.mean(axis=0)

X    0.108147
Y   -0.271138
dtype: float64

In [209]:
df.mean(axis='columns')

0    0.747834
1    1.094071
2   -0.859566
3    0.072799
4   -1.462616
dtype: float64

In [210]:
planets.tail(5)

       method  number  orbital_period  mass  distance  year
1030  Transit       1        3.941507   NaN     172.0  2006
1031  Transit       1        2.615864   NaN     148.0  2007
1032  Transit       1        3.191524   NaN     174.0  2007
1033  Transit       1        4.125083   NaN     293.0  2008
1034  Transit       1        4.187757   NaN     260.0  2008

In [212]:
planets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1035 entries, 0 to 1034
Data columns (total 6 columns):
method            1035 non-null object
number            1035 non-null int64
orbital_period    992 non-null float64
mass              513 non-null float64
distance          808 non-null float64
year              1035 non-null int64
dtypes: float64(3), int64(2), object(1)
memory usage: 48.6+ KB

In [213]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

In [214]:
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

## GroupBy: 分割, 应用和组合

In [217]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [219]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

### GroupBy 对象

In [220]:
planets.head(2)

            method  number  orbital_period  mass  distance  year
0  Radial Velocity       1         269.300  7.10     77.40  2006
1  Radial Velocity       1         874.774  2.21     56.95  2008

In [221]:
planets.groupby('method')['orbital_period'].mean()

method
Astrometry                          631.180000
Eclipse Timing Variations          4751.644444
Imaging                          118247.737500
Microlensing                       3153.571429
Orbital Brightness Modulation         0.709307
Pulsar Timing                      7343.021201
Pulsation Timing Variations        1170.000000
Radial Velocity                     823.354680
Transit                              21.102073
Transit Timing Variations            79.783500
Name: orbital_period, dtype: float64

In [222]:
for (method, group) in planets.groupby('method'):
    print("{0:30s} shape{1}".format(method, group.shape))

Astrometry                     shape(2, 6)
Eclipse Timing Variations      shape(9, 6)
Imaging                        shape(38, 6)
Microlensing                   shape(23, 6)
Orbital Brightness Modulation  shape(3, 6)
Pulsar Timing                  shape(5, 6)
Pulsation Timing Variations    shape(1, 6)
Radial Velocity                shape(553, 6)
Transit                        shape(397, 6)
Transit Timing Variations      shape(4, 6)

In [223]:
 planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [224]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                'data1': range(6),
                'data2': np.random.randint(0, 10, 6)},
                 )
df

  key  data1  data2
0   A      0      1
1   B      1      0
2   C      2      4
3   A      3      2
4   B      4      9
5   C      5      9

In [227]:
df.groupby('key').aggregate([min, np.median, max]) # 合计

    data1            data2
      min median max   min median max
key
A       0    1.5   3     1    1.5   2
B       1    2.5   4     0    4.5   9
C       2    3.5   5     4    6.5   9

In [230]:
df.groupby('key').aggregate({'data1':'min', 'data2':'max'})

     data1  data2
key
A        0      2
B        1      9
C        2      9

In [231]:
def filter_func(x):
    return x['data1'].max() > 4

In [232]:
df.groupby('key').max()

     data1  data2
key
A        3      2
B        4      9
C        5      9

In [233]:
df.groupby('key').filter(filter_func)

  key  data1  data2
2   C      2      4
5   C      5      9

In [234]:
df.groupby('key').mean()

     data1  data2
key
A      1.5    1.5
B      2.5    4.5
C      3.5    6.5

In [235]:
df.groupby('key').transform(lambda x: x-x.mean())

   data1  data2
0   -1.5   -0.5
1   -1.5   -4.5
2   -1.5   -2.5
3    1.5    0.5
4    1.5    4.5
5    1.5    2.5

In [238]:
df

  key  data1  data2
0   A      0      1
1   B      1      0
2   C      2      4
3   A      3      2
4   B      4      9
5   C      5      9

In [239]:
def norm_by_data2(x):
    # x is a DataFrame of group values
    x['data1'] /= x['data2'].sum() 
    return x

In [240]:
df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      1
1   B  0.111111      0
2   C  0.153846      4
3   A  1.000000      2
4   B  0.444444      9
5   C  0.384615      9

### 设置分割的键

In [241]:
df2 = df.set_index('key')
df2

     data1  data2
key
A        0      1
B        1      0
C        2      4
A        3      2
B        4      9
C        5      9

In [244]:
mapping = {'A': 'vowel', 'B': 'consonant', 
           'C': 'consonant'}
df2.groupby(mapping).sum()

           data1  data2
consonant     12     22
vowel          3      3

In [245]:
df2.groupby(str.lower).mean()

   data1  data2
a    1.5    1.5
b    2.5    4.5
c    3.5    6.5

In [249]:
df2.groupby([str, mapping]).mean()

             data1  data2
A vowel        1.5    1.5
B consonant    2.5    4.5
C consonant    3.5    6.5

In [250]:
decade = 10 * (planets['year'] // 10) # 数值数组
decade = decade.astype(str) + 's' # 字符串数组
decade.name = 'decade' #为数组命名

In [251]:
planets.groupby(['method', decade])['number'].sum()

method                     decade
Astrometry                 2010s       2
Eclipse Timing Variations  2000s       5
                           2010s      10
Imaging                    2000s      29
                           2010s      21
                                    ...
Radial Velocity            2000s     475
                           2010s     424
Transit                    2000s      64
                           2010s     712
Transit Timing Variations  2010s       9
Name: number, Length: 19, dtype: int64

In [253]:
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0) 
# unstack()的作用是将MultiINdex类型的Series转化为DataFrame的数据格式。

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0